"""
   名称：
        
   简介：
        1.
"""

from pyecharts.charts import Bar
from pyecharts.charts import Pie
from pyecharts.charts import Scatter
from pyecharts.charts import Gauge
from pyecharts.charts import Funnel
from pyecharts.charts import Geo
from pyecharts.charts import WordCloud
from pyecharts.charts import Line, Grid

from pyecharts.charts import Page

page = Page()  # 用于同一个页面加载多个图
attr = ['衬衫', '羊毛衫', '雪纺衫', '裤子', '高跟鞋', '袜子']

# 柱状图
b1 = [5, 20, 36, 10, 75, 90]
b2 = [10, 25, 8, 60, 20, 80]
bar = Bar('各商家产品销售情况_柱状图')
bar.add('商家A', attr, b1, is_stack=True, is_more_utils=True)  # 显示工具
bar.add('商家B', attr, b2, is_stack=True)
# bar.render()

# 饼图
p1 = [11, 12, 14, 15, 10, 12]
pie = Pie('饼图')
pie.add('', attr, p1, is_label_show=True)

# 圆环图
p2 = [11, 12, 14, 15, 10, 12]
pie2 = Pie('圆环图', title_pos='center')
pie2.add('', attr, p1, radius=[40, 75], label_text_color=None, \
         is_label_show=True, legend_orient='vertical', legend_pos='left')

# 散点图
s1 = [10, 20, 30, 40, 50, 60]
s2 = [10, 20, 30, 40, 50, 60]
scatter = Scatter('散点图')
scatter.add('A', s1, s2)
scatter.add('B', s1[::-1], s2)

# 仪表盘
gauge = Gauge('业务指标完成率-仪表盘')
gauge.add('业务指标', '完成率', 66.6)

# 漏斗图
attr2 = ['潜在', '接触', '意向', '明确', '投入', '谈判', '成交']
value = [140, 120, 100, 80, 60, 40, 20]
funnel = Funnel('销售管理分析漏斗图')
funnel.add('商品', attr2, value, is_label_show=True, \
           label_pos='inside', label_text_color='#fff')

# 地图
data = {'宿迁市': 89, '安康市': 46, '佳木斯市': 50, '威海市': 65, '安庆市': 40, '驻马店市': 33, '昆明市': 109, '六安市': 58, '天水市': 42,
        '和田地区': 73, '太原市': 91, '广州市': 90, '兴安盟': 72, '长治市': 53, '沧州市': 63, '喀什地区': 56, '株洲市': 82, '承德市': 53,
        '黄南藏族自治州': 42, '临汾市': 89, '张家界市': 97, '珠海市': 33, '上饶市': 84, '清远市': 94, '临沂市': 34, '西安市': 66, '江门市': 86,
        '滨州市': 45, '攀枝花市': 46, '宜昌市': 53, '遂宁市': 70, '图木舒克市': 33, '平顶山市': 34, '安顺市': 90, '郑州市': 50, '万宁市': 78,
        '黄冈市': 32, '大庆市': 65, '绥化市': 99, '铜陵市': 92, '大连市': 93, '荆门市': 61, '阜阳市': 66, '绍兴市': 104, '淄博市': 32, '南充市': 78,
        '潜江市': 53, '榆林市': 44, '广元市': 64, '娄底市': 92, '钦州市': 51, '黑河市': 65, '文昌市': 54, '石家庄市': 82, '惠州市': 30, '荆州市': 101,
        '巴中市': 76, '金昌市': 47, '中山市': 106, '大兴安岭地区': 56, '邵阳市': 55, '河源市': 70, '宜春市': 49, '朔州市': 84, '银川市': 43,
        '石嘴山市': 95, '徐州市': 107, '大同市': 67, '德州市': 106, '汉中市': 65, '巢湖市': 108, '吉安市': 84, '定安县': 72, '泰安市': 69,
        '铁岭市': 91, '鹤岗市': 61, '广安市': 67, '临夏回族自治州': 60, '临高县': 56, '内江市': 102, '营口市': 53, '宣城市': 105, '云浮市': 94,
        '泰州市': 42, '延安市': 91, '庆阳市': 78, '镇江市': 66, '仙桃市': 94, '商丘市': 58, '成都市': 57, '肇庆市': 53, '张掖市': 68, '呼伦贝尔市': 81,
        '伊春市': 53, '五指山市': 75, '朝阳市': 74, '宜宾市': 85, '马鞍山市': 97, '通化市': 42, '日照市': 81, '神农架林区': 89, '安阳市': 56,
        '儋州市': 48, '铜川市': 56, '辽阳市': 68, '贺州市': 53, '抚顺市': 106, '来宾市': 35, '石河子市': 84, '新乡市': 87, '武汉市': 69, '岳阳市': 72,
        '深圳市': 97, '周口市': 46, '淮北市': 100, '柳州市': 84, '保定市': 91, '韶关市': 31, '苏州市': 69, '新余市': 101, '三明市': 93, '济南市': 89,
        '兰州市': 110, '屯昌县': 47, '东营市': 69, '淮安市': 106, '开封市': 63, '莱芜市': 64, '西宁市': 109, '天门市': 65, '毕节地区': 63,
        '葫芦岛市': 82, '鄂尔多斯市': 85, '河池市': 91, '重庆市': 109, '莆田市': 107, '辽源市': 95, '许昌市': 48, '铜仁地区': 59, '焦作市': 82,
        '海口市': 39, '通辽市': 86, '东方市': 77, '黄石市': 87, '佛山市': 54, '漯河市': 56, '福州市': 84, '泉州市': 88, '衢州市': 86, '抚州市': 94,
        '信阳市': 77, '漳州市': 31, '桂林市': 62, '梧州市': 68, '枣庄市': 66, '九江市': 56, '南阳市': 60, '玉溪市': 55, '塔城地区': 63, '衡阳市': 76,
        '洛阳市': 101, '拉萨市': 54, '阿拉善盟': 61, '恩施市': 80, '百色市': 36, '天津市': 79, '曲靖市': 94, '乌鲁木齐市': 32, '赤峰市': 53,
        '贵阳市': 77, '济宁市': 63, '上海市': 30, '汕尾市': 46, '南平市': 43, '宁波市': 85, '湘潭市': 105, '邯郸市': 34, '包头市': 72, '北京市': 48,
        '烟台市': 57, '锦州市': 93, '崇左市': 109, '台州市': 40, '昌都地区': 49, '长沙市': 67, '怀化市': 108, '咸宁市': 67, '青岛市': 63,
        '雅安市': 107, '金华市': 91, '白山市': 42, '海东地区': 102, '白城市': 84, '黄山市': 74, '孝感市': 47, '三亚市': 94, '阳泉市': 109,
        '淮南市': 88, '哈密地区': 77, '吉林市': 32, '南昌市': 37, '吐鲁番地区': 67, '嘉兴市': 51, '鸡西市': 104, '中卫市': 42, '达州市': 34,
        '常德市': 52, '阿克苏地区': 47, '固原市': 103, '白银市': 46, '七台河市': 44, '宝鸡市': 92, '随州市': 68, '商洛市': 49, '济源市': 101,
        '日喀则地区': 51, '丹东市': 95, '邢台市': 73, '克拉玛依市': 51, '蚌埠市': 102, '十堰市': 45, '茂名市': 107, '南宁市': 91, '自贡市': 46,
        '眉山市': 46, '四平市': 98, '鄂州市': 68, '扬州市': 61, '锡林郭勒盟': 68, '遵义市': 85, '衡水市': 106, '湖州市': 95, '景德镇市': 38,
        '林芝地区': 39, '宁德市': 95, '本溪市': 103, '吕梁市': 66, '玉林市': 41, '永州市': 31, '赣州市': 58, '萍乡市': 49, '阜新市': 52, '晋城市': 62,
        '东莞市': 95, '贵港市': 101, '芜湖市': 64, '池州市': 81, '鞍山市': 32, '丽水市': 60, '滁州市': 77, '温州市': 76, '楚雄市': 59, '鹰潭市': 35,
        '酒泉市': 107, '那曲地区': 71, '德阳市': 85, '嘉峪关市': 87, '五家渠市': 97, '泸州市': 98, '三门峡市': 51, '沈阳市': 110, '潍坊市': 64,
        '六盘水市': 91, '聊城市': 54, '琼海市': 98, '廊坊市': 63, '杭州市': 35, '阿里地区': 56, '宿州市': 38, '渭南市': 88, '盘锦市': 60, '咸阳市': 39,
        '哈尔滨市': 30, '乐山市': 32, '资阳市': 92, '唐山市': 103, '呼和浩特市': 33, '秦皇岛': 100, '长春市': 37, '潮州市': 61, '襄樊市': 79,
        '揭阳市': 48, '松原市': 66, '忻州市': 105, '齐齐哈尔市': 36, '濮阳市': 107, '厦门市': 98, '武威市': 56, '运城市': 107, '湛江市': 41,
        '绵阳市': 45, '梅州市': 73, '山南地区': 72, '北海市': 108, '益阳市': 34, '乌海市': 95, '牡丹江市': 75, '鹤壁市': 89, '汕头市': 81, '晋中市': 88,
        '舟山市': 84, '郴州市': 51, '澄迈县': 83, '双鸭山市': 87, '南京市': 85, '阳江市': 40, '阿拉尔市': 96, '张家口市': 98, '合肥市': 34, '龙岩市': 35,
        '平凉市': 73}
geo = Geo('全国主要城市空气质量', 'data from AQI', title_color='#fff', \
          title_pos='center', width=1200, height=600, background_color='#404a59')
attr, value = geo.cast(data)  # data is not
geo.add('', attr, value, visual_range=[0, 200], visual_text_color='#fff', \
        symbol_size=15, is_visualmap=True, is_piecewise=True, visual_split_number=6)

# 词云图
name = ['乾卦', '元始', '亨通', '和谐', '有利', '贞正坚固', '巨龙', '潜伏', '水中', '施展才用',
        '坤卦', '雌马', '守持正固', '君子', '有所前往', '抢先居首', '迷入歧途', '随从', '做主', '安顺']
value = [10000, 6181, 4378, 4054, 2468, 2214, 1969, 1479, 1123, 3210,
         9988, 4563, 866, 563, 3345, 2306, 785, 653, 126, 345]
wordcloud = WordCloud(width=1200, height=620)
wordcloud.add('', name, value, word_size_range=[20, 100])

# 组合图
line = Line('折线图', width=1200)
attr = ['周一', '周二', '周三', '周四', '周五', '周六', '周日']
line.add('最高气温', attr, [11, 12, 14, 11, 12, 15, 16], mark_point=['max', 'min'], \
         mark_line=['average'])
line.add('最低气温', attr, [1, -1, 2, 5, 2, 3, 0], mark_point=['max', 'min'], \
         mark_line=['average'], legend_pos='20%')
attr = ['衬衫', '羊毛衫', '雪纺衫', '裤子', '高跟鞋', '袜子']
v1 = [11, 12, 14, 10, 11, 10]
pie = Pie('饼图', title_pos='55%')
pie.add('', attr, v1, radius=[45, 65], center=[65, 50], legend_pos='80%', \
        legend_orient='vertical')
grid = Grid()
grid.add(line, grid_right='55%')
grid.add(pie, grid_left='60%')
# grid.render()

page.add(bar)
page.add(pie)
page.add(pie2)
page.add(scatter)
page.add(gauge)
page.add(funnel)
page.add(geo)
page.add(wordcloud)
page.add(grid)

page.render()
